app/controllers/rightwidgets_controller.rb

  def index
    @rightwidgets = Rightwidget.all
---
SELECT  "rightwidgets".* FROM "rightwidgets" ORDER BY "rightwidgets"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    @rightwidget = Rightwidget.new(rightwidget_params)

    respond_to do |format|
      if @rightwidget.save
---
INSERT INTO "rightwidgets" ("content", "url", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", ""], ["url", ""], ["title", ""], ["created_at", 2016-08-13 15:04:49 UTC], ["updated_at", 2016-08-13 15:04:49 UTC]]

  def update
    respond_to do |format|
      if @rightwidget.update(rightwidget_params)
---
UPDATE "rightwidgets" SET "content" = ?, "url" = ?, "title" = ?, "updated_at" = ? WHERE "rightwidgets"."id" = ?  [["content", "widget no 1.\r\n"], ["url", "url1.com"], ["title", "wid1 begins"], ["updated_at", 2016-09-01 21:50:21 UTC], ["id", 2]]

  def destroy
    @rightwidget.destroy
---
DELETE FROM "rightwidgets" WHERE "rightwidgets"."id" = ?  [["id", 1]]

    def set_rightwidget
      @rightwidget = Rightwidget.find(params[:id])
---
SELECT  "rightwidgets".* FROM "rightwidgets" WHERE "rightwidgets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]