app/controllers/welcome_controller.rb

SELECT  "rightwidgets".* FROM "rightwidgets" ORDER BY "rightwidgets"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "blogs".* FROM "blogs"
SELECT "navigations".* FROM "navigations"
SELECT "events".* FROM "events"
---
def index
@rightwidgets = Rightwidget.all
@blogs = Blog.all
@navigations = Navigation.all
@events = Event.all